package homework10

// Класс для хранения некоторых данных - https://metanit.com/kotlin/tutorial/4.12.php
data class Book(val title: String, val author: String)

// Набор функциональности, который должен реализовать класс.
// Интерфейсы могут содержать объявления свойств и функций,
// а также могут содержать их реализацию по умолчанию. - https://metanit.com/kotlin/tutorial/4.8.php
//
//  Интерфейс для тех, кто умеет добавлять книги (для Админов)
interface BookAdder {
    fun addBook(book: Book)
}

// Интерфейс для тех, кто умеет брать книги (для Читателей)
interface BookBorrower {
    fun borrowBook(book: Book)
}

// ----------------------------------------------------------------------

// Реализация способности добавлять книги
class LibraryShelver : BookAdder {
    override fun addBook(book: Book) {  // перегрузка функции, указанной ещё в интерфейсе
        println("📚 [СКЛАД] Книга '${book.title}' добавлена в каталог.")
    }
}

// Реализация способности брать книги
class LibraryClient : BookBorrower {
    override fun borrowBook(book: Book) {
        println("📖 [ВЫДАЧА] Вы взяли почитать книгу '${book.title}'.")
    }
}

// ----------------------------------------------------------------------

// Класс администратор наследуется от BookAdder.
// Он может добавлять книги. Переменная implementation ОБЯЗАНА
// хранить объект любого класса, который реализует интерфейс BookAdder,
// которому мы делегируем реализацию каких-либо методов через by
class Admin(implementation: BookAdder) : BookAdder by implementation

// Читатель "делегирует" взятие книг объекту implementation
class Reader(implementation: BookBorrower) : BookBorrower by implementation

// ----------------------------------------------------------------------

fun main() {
    // Создаем переменные implementation, которые являются экземплярами классов
    // LibraryShelver/LibraryClient, которые реализуют BookAdder/BookBorrower
    val shelverLogic = LibraryShelver()
    val clientLogic = LibraryClient()

    // Создаем пользователей
    val adminIvan = Admin(shelverLogic)
    val readerDima = Reader(clientLogic)

    val book1 = Book("Kotlin в действии", "Дмитрий Жемеров")
    val book2 = Book("Война и мир", "Лев Толстой")

    println("--- Действия Админа ---")
    adminIvan.addBook(book1) // Вызов перейдет в LibraryShelver

    println("\n--- Действия Читателя ---")
    readerDima.borrowBook(book2) // Вызов перейдет в LibraryClient
}

